Repository: eticialima/myportfolio
Catalog: src/locale/messages.*.xlf
Languages: fr

source: Nenhum item
fr: pas d'objet

source: Demo
fr: Démo

source: Quero!
fr: Je veux!

source: Siga-me nas redes sociais
fr: Suivez-moi sur les réseaux sociaux

source: Inicio
fr: Démarrer

source: Sobre
fr: Sur

source: Projetos
fr: Projets

source: Cursos
fr: Cours

source: Contato
fr: Contacter

source: Sobre Mim!
fr: Sur moi!

source: Apaixonada por Desenvolvimento e Computação Gráfica 3D
fr: Passionné par le développement 3D et l'infographie

source: Ei! Meu nome é Letícia Lima, atualmente trabalho com desenvolvimento de sistemas com Python e Django Framework. Nos tempos livre trabalho como freelancer em projetos de Desenvolvimento Web.
fr: Hé! Je m'appelle Letícia Lima, je travaille actuellement dans le développement de systèmes avec Python et Django Framework. Pendant mon temps libre, je travaille en tant que freelance sur des projets de développement Web.

source: Sou formada em Engenharia da Computação com foco em programação e sistemas, possuo uma visão ampla e sólida de ferramentas e conceitos. Tenho experiência em Python, Django e Angular, programando diversos tipos de aplicações Web.
fr: Je suis diplômé en génie informatique avec une spécialisation en programmation et systèmes, j'ai une vision large et solide des outils et des concepts. J'ai de l'expérience en Python, Django et Angular, en programmant différents types d'applications Web.

source: Fique a vontade para conhecer meus projetos.
fr: N'hésitez pas à découvrir mes projets.

source: Contato!
fr: Contacter!

source: Envie uma mensagem para mim.
fr: Envoyez-moi un message.

source: Diversos Cursos com ênfase em programação direto da udemy com direito a certificado.
fr: Plusieurs cours mettant l'accent sur la programmation directement depuis udemy avec droit à un certificat.

source: Sobre Mim
fr: Sur moi

source: Diversos projetos com ênfase em desenvolvimento de software. E outros tipos de projetos.
fr: Plusieurs projets axés sur le développement de logiciels. Et d'autres types de projets.

source: Projeto TCC2020
fr: Projet TCC2020

source: Sistema de Controle de Acesso por Reconhecimento Facial
fr: Système de contrôle d'accès par reconnaissance faciale

source: Missão do projeto
fr: mission de projet

source: A missão do projeto objetiva desenvolver um sistema de baixo custo automatizado para controle de acesso utilizando reconhecimento facial. Como parâmetro de entrada, o sistema recebe uma imagem de um funcionário capturada via webcam retornando como saída uma resposta do reconhecimento das faces previamente cadastradas no banco de dados. O sistema consiste em três partes: detecção facial, extração de características e reconhecimento. A detecção facial foi implementada usando-se o algoritmo de Rede Neural Convolucional, que tem como base o aprendizado profundo que pode captar uma imagem de entrada e atribuir importâncias como pesos e vieses a vários aspectos para a extração. Além disso, foi utilizado os conceitos de Deep Learning, que junto com a função ConvNet é capaz de reduzir as imagens extraídas para uma forma mais fácil de processar o treinamento, sem perder qualidade e boa previsão.
fr: Le projet a pour mission de développer un système automatisé à faible coût de contrôle d'accès par reconnaissance faciale. En paramètre d'entrée, le système reçoit une image d'un employé capturée via webcam, renvoyant en sortie une réponse issue de la reconnaissance des visages précédemment enregistrés dans la base de données. Le système se compose de trois parties : la détection de visage, l'extraction de caractéristiques et la reconnaissance. La détection des visages a été mise en œuvre à l'aide de l'algorithme Convolutional Neural Network, qui est basé sur un apprentissage en profondeur capable de capturer une image d'entrée et d'attribuer une importance telle que des poids et des biais à divers aspects pour l'extraction. De plus, des concepts d'apprentissage en profondeur ont été utilisés, qui, avec la fonction ConvNet, sont capables de réduire les images extraites à un moyen plus simple de traiter la formation, sans perte de qualité et de bonne prédiction.

source: Protótipo funcionando PC
fr: Prototype de travail sur PC

source: Para o reconhecimento de faces foi desenvolvido um código que realiza o processamento de extração das faces através de uma câmera digital. O método utilizado é baseado na identificação dos atributos faciais do usuário. Foi utilizado Rede Neural pela facilidade que a rede tem de receber informações e compará-las com outras informações em um tempo muito curto. Nesse vídeo mostro para vocês o protótipo funcionamento no PC.
fr: Pour la reconnaissance des visages, un code a été développé qui effectue l'extraction des visages à travers un appareil photo numérique. La méthode utilisée est basée sur l'identification des attributs faciaux de l'utilisateur. Le réseau de neurones a été utilisé en raison de la capacité du réseau à recevoir des informations et à les comparer avec d'autres informations en très peu de temps. Dans cette vidéo, je vous montre le prototype fonctionnel sur PC.

source: Diagrama Fluxo dos dados
fr: Diagramme de flux de données

source: A figura a baixo expõe claramente um exemplo de controle de acesso. Para isso foi utilizado o algoritmo Python e biblioteca Kivy para criar a interface onde será feito o cadastro das pessoas, fazendo assim a extração das características faciais e enviando as imagens capturadas para uma unidade central com um banco de dados, nesse caso SQLite. Foi desenvolvido um código que atua dentro do Raspberry Pi que é responsável por fazer o treinamento dos rosto das informações que foram cadastradas. Após o treinamento o usuário cadastrado esta pronto para fazer o reconhecimento. A câmera é configurada utilizando os conceitos das bibliotecas do OpenCV, então a mesma esta sempre em modo ativo. Como exemplo foi utilizado um terminal com display, micro controlador e câmera, o usuário vai se aproximar da câmera e o reconhecimento será feito. Se o reconhecimento positivo vai aparecer as informações na tela do usuário.
fr: La figure ci-dessous expose clairement un exemple de contrôle d'accès. Pour cela, l'algorithme Python et la bibliothèque Kivy ont été utilisés pour créer l'interface où se fera l'enregistrement des personnes, extrayant ainsi les traits du visage et envoyant les images capturées à une unité centrale avec une base de données, en l'occurrence SQLite. Un code a été développé qui fonctionne au sein du Raspberry Pi, qui est chargé de former les visages des informations qui ont été enregistrées. Après la formation, l'utilisateur enregistré est prêt à effectuer la reconnaissance. La caméra est configurée à l'aide des concepts des bibliothèques OpenCV, elle est donc toujours en mode actif. A titre d'exemple, un terminal avec écran, microcontrôleur et caméra a été utilisé, l'utilisateur s'approchera de la caméra et la reconnaissance se fera. Si la reconnaissance positive apparaîtra les informations sur l'écran de l'utilisateur.

source: Equipamentos Utilizados
fr: Equipements d'occasion

source: Para a ideia do projeto não tínhamos um mega terminal. Então adaptamos um modelo um pouco diferente. foi utilizado um suporte do Ipad com teclado e adaptamos um display de 7 polegadas. atrás do Ipad adaptamos um suporte para colocar a câmera e o Raspberry Pi 4.
fr: Pour l'idée du projet, nous n'avions pas de méga terminal. Nous avons donc adapté un modèle légèrement différent. un support Ipad avec un clavier a été utilisé et nous avons adapté un écran de 7 pouces. derrière l'Ipad nous avons adapté un support pour placer la caméra et le Raspberry Pi 4.

source: Projeto fase 1
fr: Projet phase 1

source: Esse vídeo foi os primeiros testes no PC para dar inicio no protótipo. Verificamos principalmente a parte da interface se tem suporte com as bibliotecas de reconhecimento facial. então foi montado um modelo em Python com biblioteca Kivy. E utilizamos um código <a class="link-sucess" href="https://www.youtube.com/watch?v=jqSRzuCAwhY">[Hindi] Part-1 Facial Recognition System Using Opencv |OpenCV|Python|2018</a> apenas para teste, e obtivemos um resultado muito bom. E começamos a desenvolver.
fr: Cette vidéo était les premiers tests sur PC pour démarrer le prototype. Nous vérifions principalement la partie interface si elle est supportée par les bibliothèques de reconnaissance faciale. puis un modèle en Python avec la bibliothèque Kivy a été créé. Et nous utilisons un code <a class="link-sucess" href="https://www.youtube.com/watch?v=jqSRzuCAwhY">[Hindi] Système de reconnaissance faciale Partie 1 utilisant Opencv |OpenCV|Python|2018</a> uniquement pour les tests, et nous avons obtenu un très bon résultat. Et nous avons commencé à nous développer.

source: Slide do Projeto
fr: Diapositive de projet
